#================================================================
#================================================================

# def gen(n):
#     for i in range(1, n + 1):
#         yield i ** 2

# n = int(input("Введите переменную: "))

# a = gen(n)

#================================================================
#================================================================

# def gen1(n):
#     for i in range(1, n + 1):
#         if (i % 2 == 0):
#             yield i
#         else:
#             pass

# n = int(input("Введите переменную: "))

# i = next(gen1(n))
# print(i, end = "")

# num = 0
# for i in gen1(n):
#     if (num > 0):
#         print(", ", i, end = "")
#     else:
#         num += 1



#================================================================
#================================================================


def gen2(n):
    for i in range(1, n + 1):
        if (i % 3 == 0 and i % 4 == 0):
            yield i


n = int(input("Введите переменную: "))

for i in gen2(n):
    print(i)



# ================================================================
# ================================================================


# def gen3(a, b):
#     for i in range(a, b + 1):
#         yield i ** 2


# a = int(input("Левая граница: "))
# b = int(input("Правая граница: "))

# for i in gen3(a, b):
#     print(i)


# ================================================================
# ================================================================

# def gen4(n):
#     for i in range(n, 0, -1):
#         yield i

# n = int(input("Введите переменную: "))
# for i in gen4(n):
#     print(i)
